<?php

// ==============================
// セッション開始
// ==============================
session_start();

// ==============================
// Cookieの保存期間
// ==============================
require_once __DIR__ . '/../../include/common/cookie.php';

// ==============================
// 共通認証処理
// ==============================
require_once __DIR__ . '/../../include/common/auth.php';

// ==============================
// ログイン状態を確認
// ==============================
require_login();


// ==============================
// 購入商品を取得
// ==============================
$purchase_items = $_SESSION['purchase_items'] ?? [];


// ==============================
// 購入情報を表示したらセッションから削除
// ==============================
unset($_SESSION['purchase_items']);


// ==============================
// View読み込み
// ==============================
include_once __DIR__ . '/../../include/view/complete_view.php';
